<template>
<pre>
玩法说明：
  {换一本}按钮：可从新生成一本
  {页码输入框}：输入想要的页码编号，点击确定即可跳跃到该页，从0开始
  {上一页}按钮：点击可跳转到上一张
  {下一页}按钮：点击可跳转到下一张
  {第一种好运工具}：为上下方向刮刀
  {第二种好运工具}：为左右方向刮刀
  {第三种好运工具}：为圆形刮刀
  {大小调节滑块}：拖动滑块可选择刮刀宽度或大小
  {兑奖区}：刮开兑奖区的70%，即可结算获奖金额
  <a style="color: brown;">
  注：在彩票显示范围内按住鼠标左键即可刮奖，刮奖时尽量不要离开彩票显示区域，否则需要重新在彩票显示范围按住鼠标左键继续刮奖
  </a>
概率公示：
  奖组公布概率如下：
  200元获奖概率：0.2%
  500元获奖概率：0.08%
  1000元获奖概率：0.04%
  5000元获奖概率：0.002%
  800000元获奖概率：0.00004%

  本程序算法概率测试结果如下
  第一次共生成249999750(张)测试用例，概率如下：
  出现200的概率为:0.2192958%
  出现500的概率为:0.0879709%
  出现1000的概率为:0.0440456%
  出现5000的概率为:0.0021440%
  出现800000的概率为:0.0000372%

  第二次共生成249999750(张)测试用例，概率如下：
  出现200的概率为:0.2193910%
  出现500的概率为:0.0876993%
  出现1000的概率为:0.0437780%
  出现5000的概率为:0.0021688%
  出现800000的概率为:0.0000368%

  第三次共生成249999750(张)测试用例，概率如下：
  出现200的概率为:0.2199702%
  出现500的概率为:0.0880805%
  出现1000的概率为:0.0440300%
  出现5000的概率为:0.0021992%
  出现800000的概率为:0.0000460%
</pre>
</template>

<script>
export default {
  name: "xxf-20-exp"
}
</script>

<style scoped>
pre{
  margin: 10px;
}
</style>
